In [1]:
print("hello world")

hello world

In [21]:
print("hello")

hello

python output

1. python output

In [3]:
#python is a case sensitive 
print("hello world")

hello world

In [4]:
print("salaman khan")

salaman khan

In [5]:
print(salaman khan)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3756529832.py, line 1)

In [6]:
print(7)

7

In [7]:
print(7.7)

7.7

print('hello',1,2,4,True)

In [ ]:
print()

In [12]:
print('hello',1,3,4,False,sep=' ')

hello 1 3 4 False

In [14]:
print("hello",end=' ')
print("void")

hello void

TypeError: can only concatenate str (not "int") to str

In [16]:
#static and dynamic  binding 
#Dynamic Binding
a=5
print(a)
a="Ram Ishwor Sah"
print(a)

5
Ram Ishwor Sah

In [ ]:
#Static Binding 
int a=9;
print(a)
float a=9.5;
print(a)# this is not allowed

identifires

In [18]:
#identifires
#you can't start with a digit 
1name='nitish'
print(1name)

SyntaxError: invalid decimal literal (2002849549.py, line 3)

In [19]:
name1='Ramishwor sah'
print(name1)

Ramishwor sah

In [20]:
my_variable=[1,2,3,4]
print(type(my_variable))

<class 'list'>

In [1]:
import pandas as pd
print(pd.__version__)

2.2.3

In [7]:
import numpy as np
print(nm.__version__)

2.1.3

In [5]:
data=[1,2,3,4,5]
pd.Series(data,index=[1,2,3,4,5])

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [8]:
data=np.random.randint(4,20,size=5)

In [9]:
data

array([ 7, 18,  5, 18, 11], dtype=int32)

In [19]:
array1=np.array([[1,2,3],[1,2,4]])

In [20]:
array1

array([[1, 2, 3],
       [1, 2, 4]])

In [62]:
data={
    'name':['a','b','c','d','e']*5,
    'age':np.random.randint(15,30,size=25),
    'city':['janakpur','biratnagar','gopal','Gaushala','Kathmandu']*5
}

data1=pd.Series(data)

In [22]:
data1

name                                      [a, b, c, d, e]
age                                  [15, 21, 23, 20, 15]
city    [janakpur, biratnagar, gopal, Gaushala, Kathma...
dtype: object

In [63]:
#for dataframe object in pandas
data2=pd.DataFrame(data)

In [45]:
data2

   name  age        city
0     a   24    janakpur
1     b   23  biratnagar
2     c   22       gopal
3     d   17    Gaushala
4     e   24   Kathmandu
5     a   17    janakpur
6     b   17  biratnagar
7     c   19       gopal
8     d   22    Gaushala
9     e   16   Kathmandu
10    a   24    janakpur
11    b   23  biratnagar
12    c   20       gopal
13    d   22    Gaushala
14    e   23   Kathmandu
15    a   20    janakpur
16    b   23  biratnagar
17    c   16       gopal
18    d   18    Gaushala
19    e   24   Kathmandu
20    a   24    janakpur
21    b   19  biratnagar
22    c   22       gopal
23    d   23    Gaushala
24    e   20   Kathmandu

In [65]:
data2['Salary']=np.random.randint(10000,50000,size=25)

In [28]:
data2

  name  age        city  Salary
0    a   15    janakpur   41647
1    b   21  biratnagar   42458
2    c   23       gopal   30406
3    d   20    Gaushala   22316
4    e   15   Kathmandu   41552

In [29]:
data2.drop('Salary',axis=1)

  name  age        city
0    a   15    janakpur
1    b   21  biratnagar
2    c   23       gopal
3    d   20    Gaushala
4    e   15   Kathmandu

In [30]:
data2

  name  age        city  Salary
0    a   15    janakpur   41647
1    b   21  biratnagar   42458
2    c   23       gopal   30406
3    d   20    Gaushala   22316
4    e   15   Kathmandu   41552

In [31]:
data2.drop('Salary',axis=1,inplace=True)

In [32]:
data2

  name  age        city
0    a   15    janakpur
1    b   21  biratnagar
2    c   23       gopal
3    d   20    Gaushala
4    e   15   Kathmandu

In [37]:
#to find out the name of the person who is belong to gopal city
data2[(data2['age']>20)]

  name  age        city
1    b   21  biratnagar
2    c   23       gopal

In [66]:
data2.groupby('name')['age'].agg(['min','max','mean','count'])

      min  max  mean  count
name
a      17   27  23.0      5
b      17   26  20.6      5
c      15   28  22.4      5
d      16   29  25.6      5
e      15   27  22.0      5

In [67]:
def Function(age):
   
        if age >18 and age <=25:
            return 'young'
        elif age>26:
            return 'Old'
        else:
            return "child"

In [68]:
data2['description']=data2['age'].apply(Function)

In [69]:
data2

   name  age        city  Salary description
0     a   27    janakpur   46057         Old
1     b   21  biratnagar   44851       young
2     c   15       gopal   19426       child
3     d   28    Gaushala   36594         Old
4     e   23   Kathmandu   19667       young
5     a   25    janakpur   35160       young
6     b   18  biratnagar   47693       child
7     c   28       gopal   11447         Old
8     d   28    Gaushala   18820         Old
9     e   26   Kathmandu   28592       child
10    a   17    janakpur   22582       child
11    b   21  biratnagar   38259       young
12    c   19       gopal   34205       young
13    d   16    Gaushala   43651       child
14    e   15   Kathmandu   36309       child
15    a   25    janakpur   28718       young
16    b   26  biratnagar   22965       child
17    c   28       gopal   40443         Old
18    d   29    Gaushala   38704         Old
19    e   27   Kathmandu   26146         Old
20    a   21    janakpur   17681       young
21    b   17  biratnagar   24848       child
22    c   22       gopal   25833       young
23    d   27    Gaushala   47651         Old
24    e   19   Kathmandu   29560       young

In [ ]:
data

In [3]:
import pandas as pd
print(pd.__version__)
import numpy as np
print(np.__version__)

2.2.3
2.1.3